---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.Contains(System.String)
source: html/6548108c-0ba1-b02a-3c01-e0145ddce53d.htm
---
# Autodesk.Revit.DB.ParameterMap.Contains Method

Tests for the existence of a key within the map.

## Syntax (C#)
```csharp
public virtual bool Contains(
	string key
)
```

## Parameters
- **key** (`System.String`) - The key to be searched for.

## Returns
The Contains method returns True if the key is within the map, otherwise False.